Revit 2027 API
BuiltInFailures.StairRampFailures.StairsWinderInvalidParamsFailure Property
 Cannot create the winder run because some values for the instance properties cannot be satisfied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsWinderInvalidParamsFailure { get; }
Public Shared ReadOnly Property StairsWinderInvalidParamsFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsWinderInvalidParamsFailure {
	FailureDefinitionId^ get ();
}
static member StairsWinderInvalidParamsFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace